app/controllers/mdl_users_controller.rb

  def show
    @mdl_user = MdlUser.find(params[:id])
---
SELECT * FROM `mdl_user` WHERE (`mdl_user`.`id` = 3)

  def edit
    @mdl_user = MdlUser.find(params[:id])
---
SELECT * FROM `mdl_user` WHERE (`mdl_user`.`id` = 3)

  def update
    @mdl_user = MdlUser.find(params[:id])

    respond_to do |format|
      if @mdl_user.update_attributes(params[:mdl_user])
---
SELECT * FROM `mdl_user` WHERE (`mdl_user`.`id` = 3)
UPDATE `mdl_user` SET `email` = 'rubytuesday@gmail.com' WHERE `id` = 3